; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-7-34)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-3 - location
	p1-5 - location
	p2-3 - location
	p3-4 - location
	p4-0 - location
	p5-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s4)
	(at driver4 s3)
	(at driver5 s5)
	(at driver6 s5)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at package1 s2)
	(at package2 s1)
	(at package3 s3)
	(at package4 s4)
	(at package5 s5)
	(at package6 s5)
	(at package7 s5)
	(at package8 s4)
	(at package9 s1)
	(at package10 s5)
	(at package11 s3)
	(at package12 s5)
	(at package13 s2)
	(at package14 s5)
	(at package15 s3)
	(at package16 s5)
	(at package17 s5)
	(at package18 s2)
	(at package19 s3)
	(at package20 s5)
	(at package21 s1)
	(at package22 s0)
	(at package23 s1)
	(at package24 s5)
	(at package25 s5)
	(at package26 s3)
	(at package27 s0)
	(at package28 s1)
	(at package29 s4)
	(at package30 s2)
	(at package31 s4)
	(at package32 s1)
	(at package33 s0)
	(at package34 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s5)
	(at driver5 s0)
	(at truck1 s0)
	(at truck2 s4)
	(at truck4 s2)
	(at truck5 s4)
	(at truck6 s1)
	(at truck7 s5)
	(at package1 s2)
	(at package2 s2)
	(at package3 s2)
	(at package4 s2)
	(at package5 s3)
	(at package7 s3)
	(at package8 s2)
	(at package9 s0)
	(at package10 s4)
	(at package11 s0)
	(at package12 s1)
	(at package13 s5)
	(at package14 s3)
	(at package15 s3)
	(at package16 s3)
	(at package17 s3)
	(at package18 s1)
	(at package19 s2)
	(at package20 s2)
	(at package21 s5)
	(at package22 s5)
	(at package23 s2)
	(at package24 s1)
	(at package26 s5)
	(at package27 s4)
	(at package28 s1)
	(at package29 s4)
	(at package30 s4)
	(at package31 s0)
	(at package32 s1)
	(at package33 s3)
	(at package34 s2)
	))


)

; plan
1. (board-truck driver1 s1 truck3)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 43
2. (load-truck s1 package9 truck3)
   deleted: (at package9 s1)
   added: (in package9 truck3)
   goals met: 7 of 43
3. (drive-truck driver1 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 7 of 43
4. (load-truck s3 package3 truck3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 7 of 43
5. (load-truck s3 package26 truck3)
   deleted: (at package26 s3)
   added: (in package26 truck3)
   goals met: 7 of 43
6. (drive-truck driver1 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 7 of 43
7. (drive-truck driver1 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 7 of 43
8. (load-truck s5 package7 truck3)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   goals met: 7 of 43
9. (load-truck s5 package5 truck3)
   deleted: (at package5 s5)
   added: (in package5 truck3)
   goals met: 7 of 43
10. (drive-truck driver1 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 7 of 43
11. (unload-truck s3 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s3)
   goals met: 8 of 43
12. (unload-truck s3 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 9 of 43
13. (drive-truck driver1 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 9 of 43
14. (unload-truck s0 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s0)
   goals met: 10 of 43
15. (drive-truck driver1 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 10 of 43
16. (load-truck s1 package23 truck3)
   deleted: (at package23 s1)
   added: (in package23 truck3)
   goals met: 10 of 43
17. (drive-truck driver1 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 10 of 43
18. (load-truck s2 package30 truck3)
   deleted: (at package30 s2)
   added: (in package30 truck3)
   goals met: 10 of 43
19. (drive-truck driver1 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 10 of 43
20. (drive-truck driver1 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 10 of 43
21. (unload-truck s5 package26 truck3)
   deleted: (in package26 truck3)
   added: (at package26 s5)
   goals met: 11 of 43
22. (load-truck s5 package24 truck3)
   deleted: (at package24 s5)
   added: (in package24 truck3)
   goals met: 11 of 43
23. (drive-truck driver1 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 11 of 43
24. (drive-truck driver1 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 11 of 43
25. (unload-truck s1 package24 truck3)
   deleted: (in package24 truck3)
   added: (at package24 s1)
   goals met: 12 of 43
26. (load-truck s1 package21 truck3)
   deleted: (at package21 s1)
   added: (in package21 truck3)
   goals met: 12 of 43
27. (drive-truck driver1 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 12 of 43
28. (load-truck s0 package33 truck3)
   deleted: (at package33 s0)
   added: (in package33 truck3)
   goals met: 12 of 43
29. (drive-truck driver1 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 12 of 43
30. (unload-truck s3 package33 truck3)
   deleted: (in package33 truck3)
   added: (at package33 s3)
   goals met: 13 of 43
31. (load-truck s3 package19 truck3)
   deleted: (at package19 s3)
   added: (in package19 truck3)
   goals met: 13 of 43
32. (drive-truck driver1 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 13 of 43
33. (unload-truck s2 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s2)
   goals met: 14 of 43
34. (unload-truck s2 package23 truck3)
   deleted: (in package23 truck3)
   added: (at package23 s2)
   goals met: 15 of 43
35. (drive-truck driver1 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 15 of 43
36. (drive-truck driver1 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 15 of 43
37. (unload-truck s5 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s5)
   goals met: 16 of 43
38. (load-truck s5 package20 truck3)
   deleted: (at package20 s5)
   added: (in package20 truck3)
   goals met: 16 of 43
39. (drive-truck driver1 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 16 of 43
40. (drive-truck driver1 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 16 of 43
41. (unload-truck s2 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s2)
   goals met: 17 of 43
42. (unload-truck s2 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s2)
   goals met: 18 of 43
43. (drive-truck driver1 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 18 of 43
44. (drive-truck driver1 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 18 of 43
45. (load-truck s4 package8 truck3)
   deleted: (at package8 s4)
   added: (in package8 truck3)
   goals met: 18 of 43
46. (drive-truck driver1 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 18 of 43
47. (load-truck s0 package27 truck3)
   deleted: (at package27 s0)
   added: (in package27 truck3)
   goals met: 18 of 43
48. (drive-truck driver1 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 18 of 43
49. (load-truck s1 package2 truck3)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 18 of 43
50. (drive-truck driver1 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 18 of 43
51. (unload-truck s2 package8 truck3)
   deleted: (in package8 truck3)
   added: (at package8 s2)
   goals met: 19 of 43
52. (drive-truck driver1 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 19 of 43
53. (load-truck s3 package11 truck3)
   deleted: (at package11 s3)
   added: (in package11 truck3)
   goals met: 19 of 43
54. (drive-truck driver1 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 19 of 43
55. (load-truck s0 package22 truck3)
   deleted: (at package22 s0)
   added: (in package22 truck3)
   goals met: 19 of 43
56. (drive-truck driver1 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 19 of 43
57. (drive-truck driver1 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 19 of 43
58. (unload-truck s5 package22 truck3)
   deleted: (in package22 truck3)
   added: (at package22 s5)
   goals met: 20 of 43
59. (load-truck s5 package17 truck3)
   deleted: (at package17 s5)
   added: (in package17 truck3)
   goals met: 20 of 43
60. (drive-truck driver1 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 20 of 43
61. (unload-truck s3 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s3)
   goals met: 21 of 43
62. (drive-truck driver1 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 21 of 43
63. (load-truck s4 package4 truck3)
   deleted: (at package4 s4)
   added: (in package4 truck3)
   goals met: 21 of 43
64. (drive-truck driver1 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 21 of 43
65. (drive-truck driver1 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 21 of 43
66. (unload-truck s2 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 22 of 43
67. (unload-truck s2 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 23 of 43
68. (drive-truck driver1 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 23 of 43
69. (drive-truck driver1 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 23 of 43
70. (load-truck s4 package34 truck3)
   deleted: (at package34 s4)
   added: (in package34 truck3)
   goals met: 23 of 43
71. (drive-truck driver1 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 23 of 43
72. (unload-truck s0 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s0)
   goals met: 24 of 43
73. (drive-truck driver1 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 24 of 43
74. (unload-truck s2 package34 truck3)
   deleted: (in package34 truck3)
   added: (at package34 s2)
   goals met: 25 of 43
75. (drive-truck driver1 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 25 of 43
76. (board-truck driver5 s5 truck5)
   deleted: (at driver5 s5) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 25 of 43
77. (board-truck driver2 s3 truck7)
   deleted: (at driver2 s3) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 25 of 43
78. (drive-truck driver1 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 25 of 43
79. (load-truck s4 package31 truck3)
   deleted: (at package31 s4)
   added: (in package31 truck3)
   goals met: 25 of 43
80. (unload-truck s4 package30 truck3)
   deleted: (in package30 truck3)
   added: (at package30 s4)
   goals met: 26 of 43
81. (unload-truck s4 package27 truck3)
   deleted: (in package27 truck3)
   added: (at package27 s4)
   goals met: 27 of 43
82. (drive-truck driver1 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 27 of 43
83. (drive-truck driver1 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 27 of 43
84. (load-truck s2 package18 truck3)
   deleted: (at package18 s2)
   added: (in package18 truck3)
   goals met: 27 of 43
85. (drive-truck driver1 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 27 of 43
86. (unload-truck s1 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s1)
   goals met: 28 of 43
87. (load-truck s5 package16 truck5)
   deleted: (at package16 s5)
   added: (in package16 truck5)
   goals met: 28 of 43
88. (load-truck s5 package14 truck5)
   deleted: (at package14 s5)
   added: (in package14 truck5)
   goals met: 28 of 43
89. (load-truck s5 package12 truck5)
   deleted: (at package12 s5)
   added: (in package12 truck5)
   goals met: 28 of 43
90. (drive-truck driver5 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 28 of 43
91. (unload-truck s3 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s3)
   goals met: 29 of 43
92. (unload-truck s3 package14 truck5)
   deleted: (in package14 truck5)
   added: (at package14 s3)
   goals met: 30 of 43
93. (drive-truck driver5 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 30 of 43
94. (drive-truck driver2 s3 s2 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s2)
   goals met: 30 of 43
95. (load-truck s2 package13 truck7)
   deleted: (at package13 s2)
   added: (in package13 truck7)
   goals met: 30 of 43
96. (drive-truck driver2 s2 s3 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   goals met: 30 of 43
97. (drive-truck driver2 s3 s5 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s5)
   goals met: 31 of 43
98. (unload-truck s5 package13 truck7)
   deleted: (in package13 truck7)
   added: (at package13 s5)
   goals met: 32 of 43
99. (load-truck s5 package10 truck7)
   deleted: (at package10 s5)
   added: (in package10 truck7)
   goals met: 32 of 43
100. (walk driver4 s3 p2-3)
   deleted: (at driver4 s3)
   added: (at driver4 p2-3)
   goals met: 32 of 43
101. (walk driver4 p2-3 s2)
   deleted: (at driver4 p2-3)
   added: (at driver4 s2)
   goals met: 32 of 43
102. (walk driver4 s2 p5-2)
   deleted: (at driver4 s2)
   added: (at driver4 p5-2)
   goals met: 32 of 43
103. (walk driver4 p5-2 s5)
   deleted: (at driver4 p5-2)
   added: (at driver4 s5)
   goals met: 33 of 43
104. (drive-truck driver1 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 33 of 43
105. (unload-truck s0 package31 truck3)
   deleted: (in package31 truck3)
   added: (at package31 s0)
   goals met: 34 of 43
106. (drive-truck driver1 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 34 of 43
107. (disembark-truck driver1 s3 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 35 of 43
108. (drive-truck driver5 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 35 of 43
109. (unload-truck s1 package12 truck5)
   deleted: (in package12 truck5)
   added: (at package12 s1)
   goals met: 36 of 43
110. (drive-truck driver5 s1 s4 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   goals met: 37 of 43
111. (walk driver6 s5 p1-5)
   deleted: (at driver6 s5)
   added: (at driver6 p1-5)
   goals met: 37 of 43
112. (walk driver6 p1-5 s1)
   deleted: (at driver6 p1-5)
   added: (at driver6 s1)
   goals met: 37 of 43
113. (board-truck driver6 s1 truck2)
   deleted: (at driver6 s1) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 37 of 43
114. (drive-truck driver6 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 38 of 43
115. (drive-truck driver2 s5 s4 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s4)
   goals met: 37 of 43
116. (unload-truck s4 package10 truck7)
   deleted: (in package10 truck7)
   added: (at package10 s4)
   goals met: 38 of 43
117. (drive-truck driver2 s4 s3 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s3)
   goals met: 38 of 43
118. (drive-truck driver5 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 37 of 43
119. (drive-truck driver2 s3 s5 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s5)
   goals met: 38 of 43
120. (disembark-truck driver2 s5 truck7)
   deleted: (driving driver2 truck7)
   added: (at driver2 s5) (empty truck7)
   goals met: 38 of 43
121. (walk driver2 s5 p5-2)
   deleted: (at driver2 s5)
   added: (at driver2 p5-2)
   goals met: 38 of 43
122. (walk driver2 p5-2 s2)
   deleted: (at driver2 p5-2)
   added: (at driver2 s2)
   goals met: 39 of 43
123. (drive-truck driver5 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 40 of 43
124. (board-truck driver3 s4 truck4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 39 of 43
125. (disembark-truck driver5 s4 truck5)
   deleted: (driving driver5 truck5)
   added: (at driver5 s4) (empty truck5)
   goals met: 39 of 43
126. (disembark-truck driver3 s4 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 40 of 43
127. (walk driver5 s4 p4-0)
   deleted: (at driver5 s4)
   added: (at driver5 p4-0)
   goals met: 40 of 43
128. (walk driver5 p4-0 s0)
   deleted: (at driver5 p4-0)
   added: (at driver5 s0)
   goals met: 41 of 43
129. (board-truck driver3 s4 truck4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 40 of 43
130. (drive-truck driver3 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 40 of 43
131. (disembark-truck driver6 s4 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s4) (empty truck2)
   goals met: 40 of 43
132. (drive-truck driver3 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 40 of 43
133. (disembark-truck driver3 s4 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 41 of 43
134. (board-truck driver6 s4 truck4)
   deleted: (at driver6 s4) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 41 of 43
135. (drive-truck driver6 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 41 of 43
136. (drive-truck driver6 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 42 of 43
137. (disembark-truck driver6 s2 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s2) (empty truck4)
   goals met: 42 of 43
138. (walk driver6 s2 p2-3)
   deleted: (at driver6 s2)
   added: (at driver6 p2-3)
   goals met: 42 of 43
139. (walk driver6 p2-3 s3)
   deleted: (at driver6 p2-3)
   added: (at driver6 s3)
   goals met: 42 of 43
140. (walk driver6 s3 p3-4)
   deleted: (at driver6 s3)
   added: (at driver6 p3-4)
   goals met: 42 of 43
141. (walk driver6 p3-4 s4)
   deleted: (at driver6 p3-4)
   added: (at driver6 s4)
   goals met: 42 of 43
142. (board-truck driver6 s4 truck6)
   deleted: (at driver6 s4) (empty truck6)
   added: (driving driver6 truck6)
   goals met: 42 of 43
143. (drive-truck driver6 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 43 of 43
